<script setup>
  import Step from '../Step/Step.vue';
</script>

<template>
  <section class='steps-block'>
    <h2 class='steps-block__title'>Этапы создания фирменного стиля и гайдлайна</h2>

    <ul class='steps__list'>
      <Step imageUrl='./lamp-icon.svg' imageTitle='Погружение в креативный поиск'
            firstText='Изучаем нишу и конкурентное поле, находим подходящую идею будущей коммуникации'
            secondText='Решаем, какая тональность подходит именно вашему бренду.
           Дерзкий характер или спокойный, строгий или ультрамодный'
            thirdText='Составляем подборку креативных проектов, которые соответствуют поставленной тональности стиля'
            firstTitle='Иследование среды'
            secondTitle='Поиск тональности'
            thirdTitle='Формирование мудбордов' />

      <Step imageUrl='./envelope-icon.svg' imageTitle='Разработка визуальной и вербальной айдентики'
            firstText='Придумываем название для вашего бренда и запоминающиеся слоганы'
            secondText='Создаем логотип – основной графический символ, важнейший элемент
          коммуникации, подбираем цветовую палитру для всей коммуникации'
            thirdText='Создаем дополнительные элементы дизайна: иллюстрации, фото, типографика.
          Прорабатываем дизайн на всех носителях.'
            firstTitle='Название и слоганы' secondTitle='Разработка логотипа, цвет'
            thirdTitle='Основные носители фирменного стиля' />

      <Step imageUrl='./book-icon.svg' imageTitle='Создание гайдлайна'
            firstText='Выявляем основные принципы, на которых построен фирменный стиль'
            secondText='Наглядно показываем все правила использования фирменного стиля,
           закрепляем результат в виде презентации'
            firstTitle='Основные принципы стиля' secondTitle='Составление гайдлайна'
            thirdTitle='Вы получаете готовый бренд с набором всех необходимых инструментов' />
    </ul>
  </section>
</template>

<style scoped src='./StepsBlock.css'></style>
